docs/modules/org/freemacs-org.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-07 Thu 12:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org Mode Configuration</title>
<meta name="author" content="Thomas Freeman" />
<meta name="keywords" content="Emacs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../init.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Org Mode Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1881867">1. Calfw</a>
<ul>
<li><a href="#orga724e4c">1.1. Calfw Org&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span></span></a></li>
</ul>
</li>
<li><a href="#orgd716684">2. Habitica&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span></span></a></li>
<li><a href="#org1fe9a4d">3. Olivetti</a></li>
<li><a href="#orgff93256">4. Org&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span></span></a>
<ul>
<li><a href="#org6786072">4.1. Directories</a>
<ul>
<li><a href="#org8823c1d">4.1.1. Default Directory</a></li>
<li><a href="#orgc044546">4.1.2. Location of Agenda Files</a></li>
</ul>
</li>
<li><a href="#org6438f40">4.2. Filing Notes</a>
<ul>
<li><a href="#org7c0d228">4.2.1. Default Notes File</a></li>
<li><a href="#org17f4a85">4.2.2. Refile Targets</a></li>
</ul>
</li>
<li><a href="#orgce33b64">4.3. Exporting</a></li>
<li><a href="#org62dd767">4.4. Task Management Customization</a>
<ul>
<li><a href="#orgcbc4838">4.4.1. Drawer for State Changes</a></li>
<li><a href="#org9912e81">4.4.2. Custom TODO Keywords</a></li>
<li><a href="#org64a9afa">4.4.3. Project Tags</a></li>
<li><a href="#org779ca68">4.4.4. Stuck Projects</a></li>
</ul>
</li>
<li><a href="#orgafbc030">4.5. BibLaTeX in Org-mode</a></li>
<li><a href="#org39114aa">4.6. Org-babel Languages</a></li>
<li><a href="#orgdf52216">4.7. Appearance</a>
<ul>
<li><a href="#org09a6de4">4.7.1. Hide Emphasis Characters</a></li>
<li><a href="#orgaee4cb7">4.7.2. Word Wrapping</a></li>
<li><a href="#orga68c6a3">4.7.3. Single Space Between Headline and Tags</a></li>
<li><a href="#org7fe66ec">4.7.4. Use "Clean View"</a></li>
<li><a href="#orgaa574e5">4.7.5. Native Tabs</a></li>
</ul>
</li>
<li><a href="#org3967ec7">4.8. Change TODO Keyword Colors</a></li>
<li><a href="#orgbbf51a7">4.9. Capturing Ideas</a></li>
</ul>
</li>
<li><a href="#orgfc6f499">5. Org-mind-map&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span></span></a></li>
<li><a href="#org1f46b88">6. Org-roam&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span>&#xa0;<span class="guix">guix</span></span></a></li>
<li><a href="#orgb9ea08e">7. Org Modern&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span></span></a></li>
<li><a href="#orgdb3992c">8. Org Header Sizes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span></span></a></li>
</ul>
</div>
</div>
<p>
This file provides the Org Mode configuration for my personal configuration of Emacs called Freemacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Organization/Time Management/Notes Configuration</span>
</pre>
</div>

<div id="outline-container-org1881867" class="outline-2">
<h2 id="org1881867"><span class="section-number-2">1.</span> Calfw</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/kiwanami/emacs-calfw">Calfw</a> provides a grid-based calendar view similar to what is seen in most graphical calendar programs but integrates the org agenda files. I use the fork from @zemaye as this version has fixed the issue in <code>calfw-org.el</code> where events that span multiple dates show up repeated on the display.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">calfw</span>
  <span style="color: #1ea8fc;">:straight</span> <span style="color: #ff2afc;">(</span>emacs-calfw <span style="color: #1ea8fc;">:host</span> github
                         <span style="color: #1ea8fc;">:repo</span> <span style="color: #7984D1;">"zemaye/emacs-calfw"</span>
                         <span style="color: #1ea8fc;">:branch</span> <span style="color: #7984D1;">"master"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:commands</span> <span style="color: #ff2afc;">(</span>cfw:open-calendar-buffer<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:init</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">defalias</span> '<span style="color: #42c6ff;">calfw</span> 'cfw:open-calendar-buffer<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span>cfw:fchar-junction ?&#9547;<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>cfw:fchar-vertical-line ?&#9475;<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>cfw:fchar-horizontal-line ?&#9473;<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>cfw:fchar-left-junction ?&#9507;<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>cfw:fchar-right-junction ?&#9515;<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>cfw:fchar-top-junction ?&#9519;<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>cfw:fchar-top-left-corner ?&#9487;<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>cfw:fchar-top-right-corner ?&#9491;<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>

<div id="outline-container-orga724e4c" class="outline-3">
<h3 id="orga724e4c"><span class="section-number-3">1.1.</span> Calfw Org&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span></span></h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>calfw-org.el</code>  displays org-mode events in the <code>calfw</code> calendar. I don't like the long command <code>M-x cfw:open-org-calendar</code> so I have shortened to it to <code>M-x calfworg</code> which is much easier to type and remember.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">calfw-org</span>
  <span style="color: #1ea8fc;">:straight</span> <span style="color: #ff2afc;">(</span>emacs-calfw <span style="color: #1ea8fc;">:host</span> github
                         <span style="color: #1ea8fc;">:repo</span> <span style="color: #7984D1;">"zemaye/emacs-calfw"</span>
                         <span style="color: #1ea8fc;">:branch</span> <span style="color: #7984D1;">"master"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:commands</span> <span style="color: #ff2afc;">(</span>cfw:open-org-calendar<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:init</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">defalias</span> '<span style="color: #42c6ff;">calfworg</span> 'cfw:open-org-calendar<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd716684" class="outline-2">
<h2 id="orgd716684"><span class="section-number-2">2.</span> Habitica&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span></span></h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">habitica</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:after</span> org
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span>habitica-turn-on-highlighting t<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>habitica-show-streak t<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1fe9a4d" class="outline-2">
<h2 id="org1fe9a4d"><span class="section-number-2">3.</span> Olivetti</h2>
<div class="outline-text-2" id="text-3">
<p>
Olivetti is a minor mode that can be used to center text in a buffer t make it more pleasant to read. It creates margins that are similar to the large margins you might find in a default class of a LaTeX document. I have found that large margins make reading much more pleasant.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">olivetti</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:hook</span>
  <span style="color: #ff2afc;">(</span>org-mode . olivetti-mode<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
