modules/org/freemacs-org.org
*** Default Notes File

I prefer to have all of my captured notes automatically filed into a file called ~inbox.org~. Changing ~org-default-notes-file~ can create this functionality.

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-default-notes-file (concat org-directory "/inbox.org"))
#+end_src

*** Refile Targets

**** Set Org Files for Refiling

In order to refile/move tasks from the inbox to other agenda files and subtrees, the following must be set:

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-refile-targets '((org-agenda-files :maxlevel . 3)))
#+end_src

**** Allow Refile as Top-level Heading

I want to allow for refiling org-mode tasks at the top of a file. Setting this will also require turning off completing the path in steps if ivy-mode autocompletion is used.

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-refile-use-outline-path 'file)
  (org-outline-path-complete-in-steps nil)
#+end_src
 
Setting this variable allows for refiling tasks under a new heading on the fly.

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-refile-allow-creating-parent-nodes (quote confirm))
#+end_src

** Exporting

To remove headers labeled with the ~:ignore:~ tag, the following code needs to be implemented:

#+begin_src emacs-lisp :noweb-ref org_contrib_config
  (require 'ox-extra)
  (ox-extras-activate '(ignore-headlines))
#+end_src

So that exporting Org Mode buffers doesn't lock up Emacs, the option ~org-export-in-background~ can be set to a non-nil value.

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-export-in-background t)
#+end_src

** Task Management Customization

*** Drawer for State Changes

Put changes of TODO states for org-mode into a drawer under each heading so that it does not conflict with content under the headings.

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-log-into-drawer t)
#+end_src

*** Custom TODO Keywords

Set up the sequence of org-todo task keywords to allow for delegated (WAITING) tasks and CANCELED tasks.

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-todo-keywords
   '((sequence "TODO(t)"
               "WAITING(w)"
               "|" "DONE(d)"
               "CANCELED(c)")))
#+end_src

*** Project Tags

I like to mark projects with a tag, however, I do not want my tasks to inherit these tags because I only use the project tags to locate upper-level headings. In addition, almost all of my org-mode tasks fall under some sort of project headline so it becomes meaningless if all of my tasks have the project tag. Changing this setting prevents the tag from being inherited and showing up in the agenda view.

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-tags-exclude-from-inheritance '("project"))
#+end_src

*** Stuck Projects

Stuck projects are projects which are going nowhere and need to be analyzed for next steps. Org-mode allows for custom definitions of what a "stuck project" can be so I define a stuck project as any headline with the project keyword which has no TODO item below it. Org-mode by default assumes all level 2 headings are projects which is not the case in my setup.

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-stuck-projects
   '("+project/-MAYBE-DONE"
     ("NEXT" "TODO")
     nil
     "\\<IGNORE\\>"))
#+end_src

** BibLaTeX in Org-mode

I prefer BibLaTeX over the standard BibTeX as it has more powerful features and supports more citation styles. In order to get BibLaTeX to operate in org-mode, the ~org-latex-pdf-process~ variable needs to be changed to reflect this.

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-latex-pdf-process
   '("pdflatex -interaction nonstopmode -output-directory %o %f"
     "biber %b"
     "pdflatex -interaction nonstopmode -output-directory %o %f"
     "pdflatex -interaction nonstopmode -output-directory %o %f"))
#+end_src

** Org-babel Languages

In order to use active code in org-mode, you must define which programming languages to load. For any programming language you wish to use, it must be added to the ~org-babel-load-languages~ list.

#+name: babel_languages
#+begin_src emacs-lisp
  (with-eval-after-load "org"
    (add-to-list 'org-src-lang-modes '("plantuml" . plantuml)))
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((awk . t)
     (calc . t)
     (css . t)
     (emacs-lisp . t)
     (eshell . t)
     (gnuplot . t)
     (dot . t)
     (latex . t)
     (ledger . t)
     (octave . t)
     (plantuml . t)
     (R . t)
     (scheme . t)
     (sed . t)
     (shell . t)))
#+end_src

