docs/modules/org/freemacs-org.html

<div id="outline-container-org6438f40" class="outline-3">
<h3 id="org6438f40"><span class="section-number-3">4.2.</span> Filing Notes</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org7c0d228" class="outline-4">
<h4 id="org7c0d228"><span class="section-number-4">4.2.1.</span> Default Notes File</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
I prefer to have all of my captured notes automatically filed into a file called <code>inbox.org</code>. Changing <code>org-default-notes-file</code> can create this functionality.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-default-notes-file <span style="color: #ff2afc;">(</span>concat org-directory <span style="color: #7984D1;">"/inbox.org"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org17f4a85" class="outline-4">
<h4 id="org17f4a85"><span class="section-number-4">4.2.2.</span> Refile Targets</h4>
<div class="outline-text-4" id="text-4-2-2">
</div>
<ol class="org-ol">
<li><a id="org8c3bd20"></a>Set Org Files for Refiling<br />
<div class="outline-text-5" id="text-4-2-2-1">
<p>
In order to refile/move tasks from the inbox to other agenda files and subtrees, the following must be set:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-refile-targets '<span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">(</span>org-agenda-files <span style="color: #1ea8fc;">:maxlevel</span> . 3<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgd9055de"></a>Allow Refile as Top-level Heading<br />
<div class="outline-text-5" id="text-4-2-2-2">
<p>
I want to allow for refiling org-mode tasks at the top of a file. Setting this will also require turning off completing the path in steps if ivy-mode autocompletion is used.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-refile-use-outline-path 'file<span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span>org-outline-path-complete-in-steps nil<span style="color: #1ea8fc;">)</span>
</pre>
</div>

<p>
Setting this variable allows for refiling tasks under a new heading on the fly.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-refile-allow-creating-parent-nodes <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">quote</span> confirm<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgce33b64" class="outline-3">
<h3 id="orgce33b64"><span class="section-number-3">4.3.</span> Exporting</h3>
<div class="outline-text-3" id="text-4-3">
<p>
To remove headers labeled with the <code>:ignore:</code> tag, the following code needs to be implemented:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">ox-extra</span><span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span>ox-extras-activate '<span style="color: #ff2afc;">(</span>ignore-headlines<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>

<p>
So that exporting Org Mode buffers doesn't lock up Emacs, the option <code>org-export-in-background</code> can be set to a non-nil value.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-export-in-background t<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org62dd767" class="outline-3">
<h3 id="org62dd767"><span class="section-number-3">4.4.</span> Task Management Customization</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-orgcbc4838" class="outline-4">
<h4 id="orgcbc4838"><span class="section-number-4">4.4.1.</span> Drawer for State Changes</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
Put changes of TODO states for org-mode into a drawer under each heading so that it does not conflict with content under the headings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-log-into-drawer t<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9912e81" class="outline-4">
<h4 id="org9912e81"><span class="section-number-4">4.4.2.</span> Custom TODO Keywords</h4>
<div class="outline-text-4" id="text-4-4-2">
<p>
Set up the sequence of org-todo task keywords to allow for delegated (WAITING) tasks and CANCELED tasks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-todo-keywords
 '<span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">(</span>sequence <span style="color: #7984D1;">"TODO(t)"</span>
             <span style="color: #7984D1;">"WAITING(w)"</span>
             <span style="color: #7984D1;">"|"</span> <span style="color: #7984D1;">"DONE(d)"</span>
             <span style="color: #7984D1;">"CANCELED(c)"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org64a9afa" class="outline-4">
<h4 id="org64a9afa"><span class="section-number-4">4.4.3.</span> Project Tags</h4>
<div class="outline-text-4" id="text-4-4-3">
<p>
I like to mark projects with a tag, however, I do not want my tasks to inherit these tags because I only use the project tags to locate upper-level headings. In addition, almost all of my org-mode tasks fall under some sort of project headline so it becomes meaningless if all of my tasks have the project tag. Changing this setting prevents the tag from being inherited and showing up in the agenda view.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-tags-exclude-from-inheritance '<span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"project"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org779ca68" class="outline-4">
<h4 id="org779ca68"><span class="section-number-4">4.4.4.</span> Stuck Projects</h4>
<div class="outline-text-4" id="text-4-4-4">
<p>
Stuck projects are projects which are going nowhere and need to be analyzed for next steps. Org-mode allows for custom definitions of what a "stuck project" can be so I define a stuck project as any headline with the project keyword which has no TODO item below it. Org-mode by default assumes all level 2 headings are projects which is not the case in my setup.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-stuck-projects
 '<span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"+project/-MAYBE-DONE"</span>
   <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"NEXT"</span> <span style="color: #7984D1;">"TODO"</span><span style="color: #a7da1e;">)</span>
   nil
   <span style="color: #7984D1;">"\\&lt;IGNORE\\&gt;"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgafbc030" class="outline-3">
<h3 id="orgafbc030"><span class="section-number-3">4.5.</span> BibLaTeX in Org-mode</h3>
<div class="outline-text-3" id="text-4-5">
<p>
I prefer BibLaTeX over the standard BibTeX as it has more powerful features and supports more citation styles. In order to get BibLaTeX to operate in org-mode, the <code>org-latex-pdf-process</code> variable needs to be changed to reflect this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-latex-pdf-process
 '<span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"pdflatex -interaction nonstopmode -output-directory %o %f"</span>
   <span style="color: #7984D1;">"biber %b"</span>
   <span style="color: #7984D1;">"pdflatex -interaction nonstopmode -output-directory %o %f"</span>
   <span style="color: #7984D1;">"pdflatex -interaction nonstopmode -output-directory %o %f"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org39114aa" class="outline-3">
<h3 id="org39114aa"><span class="section-number-3">4.6.</span> Org-babel Languages</h3>
<div class="outline-text-3" id="text-4-6">
<p>
In order to use active code in org-mode, you must define which programming languages to load. For any programming language you wish to use, it must be added to the <code>org-babel-load-languages</code> list.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orged09ac1"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">with-eval-after-load</span> <span style="color: #7984D1;">"org"</span>
  <span style="color: #ff2afc;">(</span>add-to-list 'org-src-lang-modes '<span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"plantuml"</span> . plantuml<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span>org-babel-do-load-languages
 'org-babel-load-languages
 '<span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">(</span>awk . t<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span>calc . t<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span>css . t<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span>emacs-lisp . t<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span>eshell . t<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span>gnuplot . t<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span>dot . t<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span>latex . t<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span>ledger . t<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span>octave . t<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span>plantuml . t<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span>R . t<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span>scheme . t<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span>sed . t<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span>shell . t<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
