modules/org/freemacs-org.org
** Appearance

This section contains modifications to how Org Mode appears in buffers.

*** Hide Emphasis Characters

Hiding emphasis characters  in Org Mode makes the text easier to read when it is being displayed directly in Emacs. This will make *bold*, /italic/, _underlined_, ~code~, and =verbatim= text show up without the *,/, _, ~, and = characters around them. 

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-hide-emphasis-markers t)
#+end_src

*** Word Wrapping

Turning on ~visual-line-mode~ allows the text to flow in Org Mode as if working in a word processors.

#+begin_src emacs-lisp :noweb-ref org_config
  (add-hook 'org-mode-hook 'visual-line-mode)
#+end_src

*** Single Space Between Headline and Tags

I keep only a single space between the headline because I find it easier to owork with when buffer sizes change or if I am editing with a mobile device. It just seems to make things simpler.

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-tags-column 0)
#+end_src

*** Use "Clean View"

Start all Emacs org-mode buffers with "clean-view" turned on. This makes it easier to see and read org-mode files as all the extra asterisks in the headings wil be hidden leading to more empty white space and a cleaner look.

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-startup-indented t)
#+end_src

*** Native Tabs

This will allow for source code blocks in emacs org-mode to be internally indented as they would normally be in their majors modes.

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-src-tab-acts-natively t)
 #+end_src
 
** Change TODO Keyword Colors

Change the color of the org-todo keywords to make it easier to see them on a color screen and distinguish between them.

#+begin_src emacs-lisp :noweb-ref org_customize
  (org-todo-keyword-faces
   '(("TODO" . org-warning)
     ("WAITING" . "yellow")
     ("CANCELED" . (:foreground "blue" :weight bold))
     ("DONE" . org-done)))
#+end_src

** Capturing Ideas

Org-capture templates make creating org-mode notes quicker and easier from any buffer using a standard template for each not type.

#+name: org_capture_templates
#+begin_src emacs-lisp :noweb-ref org_customize
   (org-capture-templates
    '(("p" "Projects item" entry (file "~/Drive/gtdprojects.org")
       "* %? :project:")
      ("s" "Someday/Maybe item" entry (file "~/Drive/gtdsomeday.org")
       "* %?\n%x")
      ("T" "Tickler file item" entry (file "~/Drive/gtdtickler.org")
       "* %?\n%^{Scheduled}t\n%x")
      ("t" "To Do Item" entry (file+headline "~/Drive/gtdinbox.org" "Tasks")
       "* TODO %? %^G\nSCHEDULED: %^{Scheduled}t DEADLINE: %^{Deadline}t\n%x")))
#+end_src

* Org-mind-map :org:

[[https://github.com/the-ted/org-mind-map][Org-mind-map]] turns any ~org-mode~ buffer into a mind map in various output formats.

#+begin_src emacs-lisp :tangle yes
  (use-package org-mind-map
    :straight t
    :after org
    :commands org-mind-map-write
    :init
    (require 'ox-org)
    :custom
    (org-mind-map-engine "dot"))
#+end_src

