docs/modules/org/freemacs-org.html

<div id="outline-container-orgdf52216" class="outline-3">
<h3 id="orgdf52216"><span class="section-number-3">4.7.</span> Appearance</h3>
<div class="outline-text-3" id="text-4-7">
<p>
This section contains modifications to how Org Mode appears in buffers.
</p>
</div>

<div id="outline-container-org09a6de4" class="outline-4">
<h4 id="org09a6de4"><span class="section-number-4">4.7.1.</span> Hide Emphasis Characters</h4>
<div class="outline-text-4" id="text-4-7-1">
<p>
Hiding emphasis characters  in Org Mode makes the text easier to read when it is being displayed directly in Emacs. This will make <b>bold</b>, <i>italic</i>, <span class="underline">underlined</span>, <code>code</code>, and <code>verbatim</code> text show up without the *,/, _, ~, and = characters around them. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-hide-emphasis-markers t<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaee4cb7" class="outline-4">
<h4 id="orgaee4cb7"><span class="section-number-4">4.7.2.</span> Word Wrapping</h4>
<div class="outline-text-4" id="text-4-7-2">
<p>
Turning on <code>visual-line-mode</code> allows the text to flow in Org Mode as if working in a word processors.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>add-hook 'org-mode-hook 'visual-line-mode<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga68c6a3" class="outline-4">
<h4 id="orga68c6a3"><span class="section-number-4">4.7.3.</span> Single Space Between Headline and Tags</h4>
<div class="outline-text-4" id="text-4-7-3">
<p>
I keep only a single space between the headline because I find it easier to owork with when buffer sizes change or if I am editing with a mobile device. It just seems to make things simpler.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-tags-column 0<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7fe66ec" class="outline-4">
<h4 id="org7fe66ec"><span class="section-number-4">4.7.4.</span> Use "Clean View"</h4>
<div class="outline-text-4" id="text-4-7-4">
<p>
Start all Emacs org-mode buffers with "clean-view" turned on. This makes it easier to see and read org-mode files as all the extra asterisks in the headings wil be hidden leading to more empty white space and a cleaner look.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-startup-indented t<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa574e5" class="outline-4">
<h4 id="orgaa574e5"><span class="section-number-4">4.7.5.</span> Native Tabs</h4>
<div class="outline-text-4" id="text-4-7-5">
<p>
This will allow for source code blocks in emacs org-mode to be internally indented as they would normally be in their majors modes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-src-tab-acts-natively t<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3967ec7" class="outline-3">
<h3 id="org3967ec7"><span class="section-number-3">4.8.</span> Change TODO Keyword Colors</h3>
<div class="outline-text-3" id="text-4-8">
<p>
Change the color of the org-todo keywords to make it easier to see them on a color screen and distinguish between them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-todo-keyword-faces
 '<span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"TODO"</span> . org-warning<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"WAITING"</span> . <span style="color: #7984D1;">"yellow"</span><span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"CANCELED"</span> . <span style="color: #df85ff;">(</span><span style="color: #1ea8fc;">:foreground</span> <span style="color: #7984D1;">"blue"</span> <span style="color: #1ea8fc;">:weight</span> bold<span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"DONE"</span> . org-done<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbbf51a7" class="outline-3">
<h3 id="orgbbf51a7"><span class="section-number-3">4.9.</span> Capturing Ideas</h3>
<div class="outline-text-3" id="text-4-9">
<p>
Org-capture templates make creating org-mode notes quicker and easier from any buffer using a standard template for each not type.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3d7e93f"><span style="color: #1ea8fc;">(</span>org-capture-templates
 '<span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"p"</span> <span style="color: #7984D1;">"Projects item"</span> entry <span style="color: #df85ff;">(</span>file <span style="color: #7984D1;">"~/Dropbox/gtd/projects.org"</span><span style="color: #df85ff;">)</span>
    <span style="color: #7984D1;">"* %? :project:"</span><span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"s"</span> <span style="color: #7984D1;">"Someday/Maybe item"</span> entry <span style="color: #df85ff;">(</span>file <span style="color: #7984D1;">"~/Dropbox/gtd/someday.org"</span><span style="color: #df85ff;">)</span>
    <span style="color: #7984D1;">"* %?\n%x"</span><span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"T"</span> <span style="color: #7984D1;">"Tickler file item"</span> entry <span style="color: #df85ff;">(</span>file <span style="color: #7984D1;">"~/Dropbox/gtd/tickler.org"</span><span style="color: #df85ff;">)</span>
    <span style="color: #7984D1;">"* %?\n%^{Scheduled}t\n%x"</span><span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"t"</span> <span style="color: #7984D1;">"To Do Item"</span> entry <span style="color: #df85ff;">(</span>file+headline <span style="color: #7984D1;">"~/Dropbox/gtd/inbox.org"</span> <span style="color: #7984D1;">"Tasks"</span><span style="color: #df85ff;">)</span>
    <span style="color: #7984D1;">"* TODO %? %^G\nSCHEDULED: %^{Scheduled}t DEADLINE: %^{Deadline}t\n%x"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfc6f499" class="outline-2">
<h2 id="orgfc6f499"><span class="section-number-2">5.</span> Org-mind-map&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span></span></h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="https://github.com/the-ted/org-mind-map">Org-mind-map</a> turns any <code>org-mode</code> buffer into a mind map in various output formats.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">org-mind-map</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:after</span> org
  <span style="color: #1ea8fc;">:commands</span> org-mind-map-write
  <span style="color: #1ea8fc;">:init</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">ox-org</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span>org-mind-map-engine <span style="color: #7984D1;">"dot"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
