modules/org/freemacs-org.org
* Org-roam :org:guix:

[[https://www.orgroam.com/][Org -roam]] adds features to make linking org notes easier and provided a database file to connect all the notes together.

#+begin_src emacs-lisp :tangle yes
  (use-package org-roam
    :defer t
    :after org
    :init
    (setq org-roam-v2-ack t) ;; Acknowledge V2 upgrade
    :custom
    (org-roam-directory (file-truename "~/Drive/org-roam"))
    :config
    (org-roam-setup)
    :custom
    (org-roam-dailies-directory "daily/")
    (org-roam-capture-templates
     '(("d" "default" plain "%?"
        :target (file+head "${slug}.org"
                           "#+title: ${title}\n")
        :unnarrowed t)))
    (org-roam-dailies-capture-templates
     '(("d" "default" entry
        "* %?"
        :target (file+head "%<%Y-%m-%d>.org"
                           "#+title: %<%Y-%m-%d>\n"))))
    :bind
    (("C-c n f" . org-roam-node-find)
     ("C-c n g" . org-roam-graph)
     ("C-c n r" . org-roam-node-random)
     (:map org-mode-map
           (("C-c n i" . org-roam-node-insert)
            ("C-c n o" . org-id-get-create)
            ("C-c n t" . org-roam-tag-add)
            ("C-c n a" . org-roam-alias-add)
            ("C-c n l" . org-roam-buffer-toggle)))))
#+end_src

* Org Modern :org:

Org Modern is a package that prettifies Org Mode buffers.

#+begin_src emacs-lisp :tangle yes :noweb yes
  (use-package org-modern
    :straight t
    :after org
    :custom
    (org-auto-align-tags nil)
    (org-catch-invisible-edits 'show-and-error)
    (org-special-ctrl-a/e t)
    (org-insert-heading-respect-content t)
    (org-pretty-entities t)
    (org-ellipsis "…")
    (org-agenda-tags-column 0)
    (org-agenda-block-separator ?─)
    (org-modern-horizontal-rule
     "──────────────────────────────────────────────────")
    (org-agenda-time-grid
     '((daily today require-timed)
       (800 1000 1200 1400 1600 1800 2000)
       " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄"))
    (org-agenda-current-time-string
     "⭠ now ─────────────────────────────────────────────────")
  :config
  <<org_modern_config>>
  (global-org-modern-mode)
  (freemacs/org-header-formatting))
#+end_src

