docs/modules/org/freemacs-org.html

<div id="outline-container-org1f46b88" class="outline-2">
<h2 id="org1f46b88"><span class="section-number-2">6.</span> Org-roam&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span>&#xa0;<span class="guix">guix</span></span></h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="https://www.orgroam.com/">Org -roam</a> adds features to make linking org notes easier and provided a database file to connect all the notes together.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">org-roam</span>
  <span style="color: #1ea8fc;">:defer</span> t
  <span style="color: #1ea8fc;">:after</span> org
  <span style="color: #1ea8fc;">:init</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> org-roam-v2-ack t<span style="color: #ff2afc;">)</span> <span style="color: #546A90;">;; </span><span style="color: #546A90;">Acknowledge V2 upgrade</span>
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span>org-roam-directory <span style="color: #a7da1e;">(</span>file-truename <span style="color: #7984D1;">"~/Dropbox/org-roam"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #ff2afc;">(</span>org-roam-setup<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span>org-roam-dailies-directory <span style="color: #7984D1;">"daily/"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>org-roam-capture-templates
   '<span style="color: #a7da1e;">(</span><span style="color: #df85ff;">(</span><span style="color: #7984D1;">"d"</span> <span style="color: #7984D1;">"default"</span> plain <span style="color: #7984D1;">"%?"</span>
      <span style="color: #1ea8fc;">:target</span> <span style="color: #A875FF;">(</span>file+head <span style="color: #7984D1;">"${slug}.org"</span>
                         <span style="color: #7984D1;">"#+title: ${title}\n"</span><span style="color: #A875FF;">)</span>
      <span style="color: #1ea8fc;">:unnarrowed</span> t<span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>org-roam-dailies-capture-templates
   '<span style="color: #a7da1e;">(</span><span style="color: #df85ff;">(</span><span style="color: #7984D1;">"d"</span> <span style="color: #7984D1;">"default"</span> entry
      <span style="color: #7984D1;">"* %?"</span>
      <span style="color: #1ea8fc;">:target</span> <span style="color: #A875FF;">(</span>file+head <span style="color: #7984D1;">"%&lt;%Y-%m-%d&gt;.org"</span>
                         <span style="color: #7984D1;">"#+title: %&lt;%Y-%m-%d&gt;\n"</span><span style="color: #A875FF;">)</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:bind</span>
  <span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c n f"</span> . org-roam-node-find<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c n g"</span> . org-roam-graph<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c n r"</span> . org-roam-node-random<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span><span style="color: #1ea8fc;">:map</span> org-mode-map
         <span style="color: #df85ff;">(</span><span style="color: #A875FF;">(</span><span style="color: #7984D1;">"C-c n i"</span> . org-roam-node-insert<span style="color: #A875FF;">)</span>
          <span style="color: #A875FF;">(</span><span style="color: #7984D1;">"C-c n o"</span> . org-id-get-create<span style="color: #A875FF;">)</span>
          <span style="color: #A875FF;">(</span><span style="color: #7984D1;">"C-c n t"</span> . org-roam-tag-add<span style="color: #A875FF;">)</span>
          <span style="color: #A875FF;">(</span><span style="color: #7984D1;">"C-c n a"</span> . org-roam-alias-add<span style="color: #A875FF;">)</span>
          <span style="color: #A875FF;">(</span><span style="color: #7984D1;">"C-c n l"</span> . org-roam-buffer-toggle<span style="color: #A875FF;">)</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb9ea08e" class="outline-2">
<h2 id="orgb9ea08e"><span class="section-number-2">7.</span> Org Modern&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span></span></h2>
<div class="outline-text-2" id="text-7">
<p>
Org Modern is a package that prettifies Org Mode buffers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">org-modern</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:after</span> org
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span>org-auto-align-tags nil<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>org-catch-invisible-edits 'show-and-error<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>org-special-ctrl-a/e t<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>org-insert-heading-respect-content t<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>org-pretty-entities t<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>org-ellipsis <span style="color: #7984D1;">"&#8230;"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>org-agenda-tags-column 0<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>org-agenda-block-separator ?&#9472;<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>org-agenda-time-grid
   '<span style="color: #a7da1e;">(</span><span style="color: #df85ff;">(</span>daily today require-timed<span style="color: #df85ff;">)</span>
     <span style="color: #df85ff;">(</span>800 1000 1200 1400 1600 1800 2000<span style="color: #df85ff;">)</span>
     <span style="color: #7984D1;">" &#9476;&#9476;&#9476;&#9476;&#9476; "</span> <span style="color: #7984D1;">"&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;&#9476;"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>org-agenda-current-time-string
   <span style="color: #7984D1;">"&#11104; now &#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;"</span><span style="color: #ff2afc;">)</span>
<span style="color: #1ea8fc;">:config</span>
