modules/org/freemacs-org.org
* Org Header Sizes

The following custom function will change the heading sizes in Org Mode to make it easier to see the different heading levels. In addition, this will also increase the size of the document title and make it more prominent. This code is modified and from [[https://github.com/daviwil][@daviwil]] from [[https://github.com/daviwil/emacs-from-scratch/blob/master/show-notes/Emacs-05.org#improving-the-look][this link]].

#+begin_src emacs-lisp :noweb-ref org_modern_config
  (defun freemacs/org-header-formatting ()
    "Change the size of headers and titles in Org Mode buffers."
    (interactive)
    (with-eval-after-load 'org
      (dolist
          (face
           '((org-level-1 . 2.00)
             (org-level-2 . 1.75)
             (org-level-3 . 1.50)
             (org-level-4 . 1.25)
             (org-level-5 . 1.10)
             (org-level-6 . 1.10)
             (org-level-7 . 1.10)
             (org-level-8 . 1.10)
             (org-document-title . 2.25)))
        (set-face-attribute (car face) nil :height (cdr face)))))
#+end_src

* End

Tell Emacs what feature this file provides.

#+begin_src emacs-lisp :tangle yes
  (provide 'freemacs-org)

  ;;; freemacs-org.el ends here
#+end_src
