docs/modules/org/freemacs-org.html
<span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff;">freemacs/org-header-formatting</span> <span style="color: #a7da1e;">()</span>
  <span style="color: #A875FF;">"Change the size of headers and titles in Org Mode buffers."</span>
  <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">interactive</span><span style="color: #a7da1e;">)</span>
  <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">with-eval-after-load</span> 'org
    <span style="color: #df85ff;">(</span><span style="color: #ff2afc; font-weight: bold;">dolist</span>
        <span style="color: #A875FF;">(</span>face
         '<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc;">(</span>org-level-1 . 2.00<span style="color: #ff2afc;">)</span>
           <span style="color: #ff2afc;">(</span>org-level-2 . 1.75<span style="color: #ff2afc;">)</span>
           <span style="color: #ff2afc;">(</span>org-level-3 . 1.50<span style="color: #ff2afc;">)</span>
           <span style="color: #ff2afc;">(</span>org-level-4 . 1.25<span style="color: #ff2afc;">)</span>
           <span style="color: #ff2afc;">(</span>org-level-5 . 1.10<span style="color: #ff2afc;">)</span>
           <span style="color: #ff2afc;">(</span>org-level-6 . 1.10<span style="color: #ff2afc;">)</span>
           <span style="color: #ff2afc;">(</span>org-level-7 . 1.10<span style="color: #ff2afc;">)</span>
           <span style="color: #ff2afc;">(</span>org-level-8 . 1.10<span style="color: #ff2afc;">)</span>
           <span style="color: #ff2afc;">(</span>org-document-title . 2.25<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span><span style="color: #A875FF;">)</span>
      <span style="color: #A875FF;">(</span>set-face-attribute <span style="color: #1ea8fc;">(</span>car face<span style="color: #1ea8fc;">)</span> nil <span style="color: #1ea8fc;">:height</span> <span style="color: #1ea8fc;">(</span>cdr face<span style="color: #1ea8fc;">)</span><span style="color: #A875FF;">)</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
<span style="color: #ff2afc;">(</span>global-org-modern-mode<span style="color: #ff2afc;">)</span>
<span style="color: #ff2afc;">(</span>freemacs/org-header-formatting<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb3992c" class="outline-2">
<h2 id="orgdb3992c"><span class="section-number-2">8.</span> Org Header Sizes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span></span></h2>
<div class="outline-text-2" id="text-8">
<p>
The following custom function will change the heading sizes in Org Mode to make it easier to see the different heading levels. In addition, this will also increase the size of the document title and make it more prominent. This code is modified and from <a href="https://github.com/daviwil">@daviwil</a> from <a href="https://github.com/daviwil/emacs-from-scratch/blob/master/show-notes/Emacs-05.org#improving-the-look">this link</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff;">freemacs/org-header-formatting</span> <span style="color: #ff2afc;">()</span>
  <span style="color: #A875FF;">"Change the size of headers and titles in Org Mode buffers."</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">interactive</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">with-eval-after-load</span> 'org
    <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">dolist</span>
        <span style="color: #df85ff;">(</span>face
         '<span style="color: #A875FF;">(</span><span style="color: #1ea8fc;">(</span>org-level-1 . 2.00<span style="color: #1ea8fc;">)</span>
           <span style="color: #1ea8fc;">(</span>org-level-2 . 1.75<span style="color: #1ea8fc;">)</span>
           <span style="color: #1ea8fc;">(</span>org-level-3 . 1.50<span style="color: #1ea8fc;">)</span>
           <span style="color: #1ea8fc;">(</span>org-level-4 . 1.25<span style="color: #1ea8fc;">)</span>
           <span style="color: #1ea8fc;">(</span>org-level-5 . 1.10<span style="color: #1ea8fc;">)</span>
           <span style="color: #1ea8fc;">(</span>org-level-6 . 1.10<span style="color: #1ea8fc;">)</span>
           <span style="color: #1ea8fc;">(</span>org-level-7 . 1.10<span style="color: #1ea8fc;">)</span>
           <span style="color: #1ea8fc;">(</span>org-level-8 . 1.10<span style="color: #1ea8fc;">)</span>
           <span style="color: #1ea8fc;">(</span>org-document-title . 2.25<span style="color: #1ea8fc;">)</span><span style="color: #A875FF;">)</span><span style="color: #df85ff;">)</span>
      <span style="color: #df85ff;">(</span>set-face-attribute <span style="color: #A875FF;">(</span>car face<span style="color: #A875FF;">)</span> nil <span style="color: #1ea8fc;">:height</span> <span style="color: #A875FF;">(</span>cdr face<span style="color: #A875FF;">)</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>



<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">provide</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-org</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Time-stamp: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-07-07 Thu 12:43&gt;</span></span></p>
<p class="author">Author: Thomas Freeman</p>
<p class="date">Created: 2022-07-07 Thu 12:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
